--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/alhu/Dropbox/research/bitcoin/code/stata/prices_study/output/FOMC.log
  log type:  text
 opened on:  29 Sep 2016, 12:20:58
. 
. ***
. *** Bitcoin and Litecoin and the principle components experience a negative pre FOMC announcement drift
. *** Effect not present for other cryptocurrencies
. gen exbtc = r_btc - ffrf
(23671 missing values generated)
. gen exltc = r_ltc - ffrf
(23895 missing values generated)
. 
. regress exbtc i.fomc i.dow, robust

Linear regression                                      Number of obs =    1239
                                                       F(  5,  1233) =    1.18
                                                       Prob > F      =  0.3163
                                                       R-squared     =  0.0053
                                                       Root MSE      =   .0545

------------------------------------------------------------------------------
             |               Robust
       exbtc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.fomc |  -.0194975   .0110581    -1.76   0.078    -.0411923    .0021973
             |
         dow |
          2  |  -.0004358   .0049036    -0.09   0.929    -.0100562    .0091845
          3  |  -.0030523   .0052819    -0.58   0.563    -.0134148    .0073103
          4  |  -.0036825   .0053942    -0.68   0.495    -.0142653    .0069003
          5  |   -.006456   .0049361    -1.31   0.191      -.01614     .003228
             |
       _cons |   .0073604   .0038401     1.92   0.056    -.0001735    .0148943
------------------------------------------------------------------------------
. regress exltc i.fomc i.dow, robust

Linear regression                                      Number of obs =    1015
                                                       F(  5,  1009) =    2.25
                                                       Prob > F      =  0.0471
                                                       R-squared     =  0.0103
                                                       Root MSE      =  .10251

------------------------------------------------------------------------------
             |               Robust
       exltc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.fomc |   -.042131   .0192815    -2.19   0.029    -.0799674   -.0042947
             |
         dow |
          2  |   .0034528   .0122205     0.28   0.778    -.0205276    .0274332
          3  |  -.0123529   .0120918    -1.02   0.307     -.036081    .0113751
          4  |  -.0101101   .0114346    -0.88   0.377    -.0325484    .0123282
          5  |  -.0142631   .0110194    -1.29   0.196    -.0358866    .0073605
             |
       _cons |   .0160488   .0096166     1.67   0.095     -.002822    .0349196
------------------------------------------------------------------------------
. regress exbtc i.fomc i.cpi i.unemp i.dow, robust

Linear regression                                      Number of obs =    1239
                                                       F(  7,  1231) =    1.30
                                                       Prob > F      =  0.2480
                                                       R-squared     =  0.0073
                                                       Root MSE      =  .05449

------------------------------------------------------------------------------
             |               Robust
       exbtc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.fomc |  -.0195043   .0110981    -1.76   0.079    -.0412776     .002269
       1.cpi |  -.0000805    .007568    -0.01   0.992    -.0149281    .0147671
     1.unemp |  -.0126569   .0072875    -1.74   0.083    -.0269542    .0016403
             |
         dow |
          2  |  -.0003805      .0049    -0.08   0.938    -.0099938    .0092327
          3  |  -.0030474   .0052805    -0.58   0.564    -.0134072    .0073125
          4  |  -.0035756   .0054294    -0.66   0.510    -.0142276    .0070763
          5  |  -.0037069   .0052191    -0.71   0.478    -.0139462    .0065323
             |
       _cons |   .0073604   .0038432     1.92   0.056    -.0001796    .0149005
------------------------------------------------------------------------------
. regress exltc i.fomc i.cpi i.unemp i.dow, robust

Linear regression                                      Number of obs =    1015
                                                       F(  7,  1007) =    3.41
                                                       Prob > F      =  0.0013
                                                       R-squared     =  0.0128
                                                       Root MSE      =  .10248

------------------------------------------------------------------------------
             |               Robust
       exltc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.fomc |  -.0423141   .0193529    -2.19   0.029    -.0802907   -.0043374
       1.cpi |   .0024946   .0142183     0.18   0.861    -.0254063    .0303955
     1.unemp |  -.0265104   .0089517    -2.96   0.003    -.0440765   -.0089444
             |
         dow |
          2  |   .0033884   .0122678     0.28   0.782     -.020685    .0274617
          3  |  -.0124629   .0121065    -1.03   0.304    -.0362198    .0112941
          4  |  -.0100069   .0115271    -0.87   0.386    -.0326267     .012613
          5  |  -.0086275   .0115884    -0.74   0.457    -.0313677    .0141126
             |
       _cons |   .0160488   .0096261     1.67   0.096    -.0028408    .0349384
------------------------------------------------------------------------------
. regress pc1 i.fomc i.dow, robust

Linear regression                                      Number of obs =     775
                                                       F(  7,   767) =    1.02
                                                       Prob > F      =  0.4158
                                                       R-squared     =  0.0113
                                                       Root MSE      =  1.8175

------------------------------------------------------------------------------
             |               Robust
         pc1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.fomc |  -1.135378   .7047628    -1.61   0.108    -2.518871    .2481146
             |
         dow |
          1  |   .1692503   .2113916     0.80   0.424    -.2457243     .584225
          2  |   .1428329   .2529257     0.56   0.572    -.3536758    .6393416
          3  |   .0922433   .2630167     0.35   0.726    -.4240748    .6085614
          4  |   .4303272   .2318734     1.86   0.064    -.0248546     .885509
          5  |   .0458321    .206379     0.22   0.824    -.3593026    .4509668
          6  |   .1717357   .2166734     0.79   0.428    -.2536074    .5970789
             |
       _cons |  -.1328445   .1471305    -0.90   0.367    -.4216707    .1559817
------------------------------------------------------------------------------
. regress pc1 i.fomc i.cpi i.unemp i.dow, robust

Linear regression                                      Number of obs =     775
                                                       F(  9,   765) =    1.36
                                                       Prob > F      =  0.2020
                                                       R-squared     =  0.0189
                                                       Root MSE      =  1.8129

------------------------------------------------------------------------------
             |               Robust
         pc1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      1.fomc |  -1.229554   .6829233    -1.80   0.072    -2.570181    .1110719
       1.cpi |   .8230878   .4931012     1.67   0.095    -.1449043     1.79108
     1.unemp |   .4561723   .2729975     1.67   0.095    -.0797408    .9920854
             |
         dow |
          1  |   .1692503   .2116677     0.80   0.424    -.2462681    .5847688
          2  |   .0909265   .2486869     0.37   0.715    -.3972632    .5791162
          3  |   .0496696   .2631333     0.19   0.850    -.4668793    .5662186
          4  |   .3825747   .2349084     1.63   0.104    -.0785668    .8437162
          5  |  -.0985921   .2287155    -0.43   0.667    -.5475765    .3503924
          6  |   .1717357   .2169564     0.79   0.429    -.2541648    .5976363
             |
       _cons |  -.1328445   .1473227    -0.90   0.367    -.4220492    .1563602
------------------------------------------------------------------------------
. 
. log close
      name:  <unnamed>
       log:  /Users/alhu/Dropbox/research/bitcoin/code/stata/prices_study/output/FOMC.log
  log type:  text
 closed on:  29 Sep 2016, 12:20:59
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
